##############
# Taps
tap "homebrew/bundle"

##############
# Binaries & Tools
brew 'asdf'
brew 'bat'
brew 'btop'
brew 'cmake'
brew 'curl'
brew 'coreutils'
brew 'cmatrix'
brew 'direnv'
brew 'fzf'
brew 'figlet' # ascii art
brew 'git'
brew 'htop'
brew 'lazygit'
brew 'lazydocker'
brew 'jq'
brew 'make'
brew 'mas'
brew 'neovim'
brew 'neofetch'
brew 'pv'
brew 'ripgrep' # required for telescope
brew 'sqlite'
brew 'stow'
brew 'starship'
brew 'sl'
brew 'tmux'
brew 'tree'
brew 'openssl'
brew 'unzip'
brew 'wget'
brew 'zsh-autosuggestions'
brew 'zero-sh/tap/apply-user-defaults'

###############
# Applications
# Misc.
cask 'zen-browser'
cask 'slack'
cask 'spotify'
cask 'notion'
cask '1password'
cask 'qmk-toolbox'
cask 'MonitorControl'
cask 'rectangle'
cask 'raycast'
cask 'cleanshot'
cask 'screen-studio'
cask 'keycastr'

# Development Tools
cask 'visual-studio-code'
cask 'warp'
# NOTE: cask not supported on apple silicon `cask 'zed'`
cask 'alacritty'
cask 'tower'
cask 'gitbutler'
cask 'orbstack'

###############
# Mac App Store
mas "system-color-picker", id: 1545870783

###############
# Hooks
