# Taps
tap "homebrew/bundle"

# Binaries
brew 'asdf'
brew 'bat'
brew 'btop'
brew 'cmake'
brew 'curl'
brew 'coreutils'
brew 'direnv'
brew 'fzf'
brew 'figlet'
brew 'git'
brew 'htop'
brew 'lazygit'
brew 'lazydocker'
brew 'jq'
brew 'make'
brew 'mas'
brew 'neovim'
brew 'pv'
brew 'ripgrep' # required for telescope
brew 'sqlite'
brew 'stow'
brew 'starship'
brew 'tmux'
brew 'tree'
brew 'openssl'
brew 'unzip'
brew 'wget'
brew 'zsh-autosuggestions'
brew 'zero-sh/tap/apply-user-defaults'

# Applications
# cask 'slack'
# cask 'spotify'
# cask '1password'
# cask 'visual-studio-code'
# cask 'zed'
# cask 'zen-browser'
# cask 'keycastor'
cask 'qmk-toolbox'
cask 'alacritty'
